<%@ Page Title="" Language="C#" MasterPageFile="~/MainMaster.Master" AutoEventWireup="true" CodeBehind="Home.aspx.cs" Inherits="OnlineEducation.Home" %>
<asp:Content ID="Content1" ContentPlaceHolderID="head" runat="server">
</asp:Content>
<asp:Content ID="Content2" ContentPlaceHolderID="ContentPlaceHolder1" runat="server">
      <p><h3>За момента няма уроци в секцията Информационни технологии както и на Графичен дизайн -> QuarkXpress</h3> </p>
    <br />
    <img src="ImagesForMasterPage/html5.png" class="img" />
  
		<p>HTML съкращение от термина на английски: (HyperText Markup Language)  в превод „език за маркиране на хипертекст“) е основният маркиращ език за описание и дизайн на уеб страници. HTML е стандарт в Интернет, а правилата се определят от международния консорциум W3C.

		</p>
		<br/>

		<img src="ImagesForMasterPage/css3.png" class="img" />
		<p>CSS (Cascading Style Sheets) е език за описание на стилове (език за стилови листове, style sheet language) – използва се основно за описване на представянето на документ, написан на език за маркиране. Най-често се използва заедно с HTML, но може да се приложи върху произволен XML документ. Официално спецификацията на CSS се поддържа от W3C. CSS е създаден с цел да бъдат разделени съдържанието и структурата на уеб страниците отделно от тяхното визуално представяне</p>

		<img src="ImagesForMasterPage/adobe.gif" class="img" />
		<p>Adobe Systems Incorporated, известни накратко като Adobe   е американска софтуерна компания разработваща софтуер за създаване на мултимедия и Интернет приложения. Сред най-големите им постижения са създаването на PostScript - езика за описване на страници и програмите Adobe Illustrator и Adobe Photoshop за графична обработка с които участват в зараждането на електронното издаване.
            Adobe Photoshop — обработка на растерни изображения , 
 Adobe Photoshop Lightroom — обработка и редактиране на растерни изображения
,Adobe Illustrator — обработка на векторни изображения
 ,Adobe Audition — обработка на цифрово аудио
 ,Adobe Premiere — редактиране на видео
 ,Adobe After Effects - добавяне на специални ефекти към видео файлове
 ,Adobe Soundbooth - Обработка на аудио файлове
		</p>

		<img src="ImagesForMasterPage/csharp.png" class="img" />
		<p>C#  е обектно-ориентиран език за програмиране, разработен от Microsoft, като част от софтуерната платформа .NET. Стремежът още при създаването на C# езика е бил да се създаде един прост, модерен, обектно-ориентиран език с общо предназначение. 
            Използва се за разработване на Web както и Windows приложения
		</p>


    <img src="ImagesForMasterPage/msoffice.png" class="img" />
    <p>
        Microsoft Office е пакет от приложения за офиса от компанията Microsoft. Microsoft Word е програма за обработка на текст и дълго време е считана за основното приложение в пакета.
        Microsoft Excel е програма за обработка на таблици и извършване на пресмятания.  Microsoft Outlook (да не се бърка с Outlook Express) е програма за управление на лична информация (календар, срещи, ангажименти, списък с телефони и адреси и т.н.) и комуникация чрез електронна поща. 
       Microsoft PowerPoint е популярна програма за създаване на презентации за Windows и Mac
    </p>
    <img src="ImagesForMasterPage/Java.png" class="img" />
    <p>
    Java  е обектно-ориентиран език за програмиране. Кодът, написан на Java не се компилира до машинен код за определен процесор, а до специфичен за езика код, наречен байт код. Поради това за изпълнението на програма, написана на Java е необходима т. нар. Виртуална машина.

    </p>
    <img src="ImagesForMasterPage/cpp.png" class="img" />
    <p>
        С++ е неспециализиран език за програмиране от високо ниво. Той е обектно-ориентиран език със статични типове.  Повечето програми на C могат директно или със съвсем малки модификации да бъдат компилирани с компилатор за езика C++. 

    </p>
    <img src="ImagesForMasterPage/learn-javascript.png" class="img" />
    <p>
        JavaScript е интерпретируем език за програмиране, разпространяван с повечето Уеб браузъри. Поддържа обектно-ориентиран и функционален стил на програмиране. 
         Най-често се прилага към HTML-а на Интернет страница с цел добавяне на функционалност и зареждане на данни. Може да се ползва също за писане на сървърни скриптове NodeJS, както и за много други приложения. JavaScript не трябва да се бърка с Java, съвпадението на имената е резултат от маркетингово решение на Netscape.
         Javascript е стандартизиран под името EcmaScript. JavaScript функции могат да се свържат със събития на страницата (например: движение/натискане на мишката, клавиатурата или елемент от страницата, и други потребителски действия). Javascript е най-широко разпространеният език за програмиране в Интернет. 
    </p>
    <img src="ImagesForMasterPage/Introduction-to-SQL.png" class="img" />
    <p>
Microsoft SQL Server е сървърна система за управление на бази от данни (и по-точно, на релационни бази от данни) на компанията Microsoft. Microsoft SQL Server е предназначена за управление на големи сървърно базирани БД за разлика от MS Access която е desktop базирана и не е предназначена за управление на големи корпоративни БД.
    </p>
    


</asp:Content>
